{
    "cv": "Resume",
    "projects": "Projects",
    "about": "About me",
    "reactDeveloper": "React developer",
    "myProjects": "MY PROJECTS",
    "experience": "EXPERIENCE",
    "experience1": "We developed robust platform for online interviews - Skreenbe. The team of developers consisted of me, other two programmers and one graphic designer. Development of the app began after Corona outbreak and lasted about 1 year. My duty was mainly front-end(React), but occasionally I solved a back-end task(Node.js).",
    "experience2Name": "Software developer - internship in Tatra Banka",
    "experience2": "I was a member of team developing a new system Gate+ which will replace outdated Gate. Gate is a system used at branches by Tatra Banka employees. My task was primarily defect-fixing on frontend in React library. There was also Redux library used.",
    "education": "EDUCATION",
    "education1University": "Commenius University in Bratislava",
    "education1Faculty": "Faculty of Math, Physics and Informatics",
    "education1Specialisation": "Applied informatics specialisation",
    "languageSkills": "LANGUAGE SKILLS",
    "nativeLanguage": "Native speaker",
    "programmingSkills": "PROGRAMMING SKILLS",
    "drivingLicence": "DRIVING LICENCE",
    "type": "Type",
    "interests": "INTERESTS",
    "interest1": "Computer",
    "interest2": "Sport",
    "interest3": "Travelling",
    "interest4": "Society",
    "myWorkingProjects": "Projects I was working on",
    "getMore": "Get More",
    "thesis": "My bachelor's thesis",
    "project1": "Platform for interactive online interviews",
    "project2": "Conference Management System",
    "project3": "Race Evaluation System",
    "project4": "Employee bank application",
    "project1Title": "Skreenbe - Platform for interactive online interviews",
    "project2Title": "Conference Management System for Faculty of Math, Physics and Informatics",
    "project3Title": "Race Evaluation System for Western slovak league in Orienteering",
    "project4Title": "Employee bank application",
    "project1Desc": "Last year I was working under the guidance of a senior programmer at GQSystems. We have programmed a platform for interactive online interviews - Skreenbe. It is a complex multilingual application with a large amount of functionality. My main task was to program front-end in React. I modified the existing application according to the requirements of boss. I also fixed various types of bugs and created new functionality.",
    "project2Desc": "As my bachelor's thesis I created a system for conference management in real time. The system is using at conferences which take place at the Faculty, for example Student Scientific Conference. Moreover, it will be using at conferences outside the faculty. Requirements for the system were strictly given and some of them required strong problem-solving skill. You can read more about system in my thesis.",
    "project3Desc": "This project was for real contractor - western slovak league in Orienteering. Previously, the points were counted manually. Now the app evaluates the results automatically. The output is HTML page with overall points according to chosen method of pointing. I worked on this project in team of 4 people. We were using Git and Github for our coordination. My main responsibility was creation of algorithms for points assignment.",
    "project4Desc": "This is my school project for subject Database 2. The primary aim is on work with database, so the app has only simple command-line UI. Otherwise the app is complex. There are three types of accounts, every of them has its own behavior. There are possible transfers among them, also in different currencies. The transfers to other banks are executed next day, so it's neccessary solve daily and monthly closing. For saving and terminated accounts also interest must be assigned.",
    "about1": "During my study at Grammar school I was interested in two specialisations - informatics and economics. I wasn't able to choose one of them, so I decided to study both. In my opinion, the university study gives you only general knowledge, specific things you must learn yourself anyway. And to get general knowledge of a certain specialisation are 3 years sufficient time.",
    "about2": "One of advantages of university study, especially in IT field, is possiblity to meet various technologies and tools. There you find out which you like and which you like less. During my study Applied informatics at Faculty of Math, Physics and Informatics and Comenius University I was impressed mainly by web applications, especially their frontend part. This is field where I see my future. During summer 2019 I was working in Tatrabanka as software developer. We were developing new system Gate+, which is supposed to replace outdated Gate. It was very interesting experience, I was especially working on defect-fixing.",
    "about3a": "Subsequently, I chose to create web application in JavaScript as my bachelor's thesis. I created application for conference management in real time. I tried full life-cycle of development - collecting requirements, their analysis, designing, it's implementation and finally testing. More about my bachelor's thesis is in",
    "about3b": "section Projects",
    "about3c": "I was required to create frontend of the app in Vanilla JavaScript. Meanwhile I started to learn React library. Now I can imagine better what it's benefits are compare to Vanilla JavaScript.",
    "about4": "My last experience is from developing interactive interviews platform - Skreenbe. It was huge app with many difference funcionalities. Under the leadership of Senior programmer I gained a lot of experience, especially with React, but also with Redux, Node.js and MongoDb.",
    "about5": "About my personality, I consider myself to be purposeful and hard-working. I like to learn new technologies and to improve my skills. Same time I'm social person. Some people don't believe when they find out I am programmer :). I like to go out on beer with friends, but I also exercise regularly. I love to travel, especially during summer.",
    "about6": "Nowadays I'd like to find a job as a react developer or something similar. Some position where I'd improve my skills. I don't plan to study more, so I prefer full-time job.",
    "seeApplication": "See application",
    "readTheThesis": "Read the thesis",
    "readSupervisor": "Read supervisor's report",
    "readOpponent": "Read oponent's report",
    "sourceCode": "Source code",
    "readDocumentation": "Read documentation",
    "githubRepo": "Github Repo",
    "assignment": "Assignment",
    "aboutProject": "About"
}