{
    "cv": "Životopis",
    "projects": "Projekty",
    "about": "O mne",
    "reactDeveloper": "React vývojár",
    "myProjects": "MOJE PROJEKTY",
    "experience": "SKÚSENOSTI",
    "experience1": "Spolu s ďalšími dvomi programátormi a grafikom sme vyvinuli robustnú platformu na online pohovory - Skreenbe. Vývoj začal po prepuknutí Corony a trval približne rok. Mojou úlohou bol najmä front-end(React), ale občas som vyskúšal aj niečo z back-endu(Node.js).",
    "experience2Name": "Softvérový vývojár - stáž v Tatra Banke",
    "experience2": "Bol som členom týmu, ktorý pracoval na vývoji nového systému Gate+, ktorý nahradí zastaralý Gate. Gate je systém, ktorý využívajú zamestnanci na pobočkách. Mojou úlohou bolo najmä fixovanie defektov na frontende, ktorý bol napísaný v knižnici React. V tomto projekte sme používali taktiež knižnicu Redux.",
    "education": "VZDELANIE",
    "education1University": "Komenského Univerzita v Bratislave",
    "education1Faculty": "Fakulta matematiky, fyziky a informatiky",
    "education1Specialisation": "Odbor Aplikovaná informatika",
    "education2University": "Masarykova Univerzita v Brne",
    "education2Faculty": "Ekonomicko-správni fakulta",
    "education2Specialisation": "Odbor Podniková ekonomika a management",
    "languageSkills": "JAZYKOVÉ ZNALOSTI",
    "nativeLanguage": "Materinský jazyk",
    "programmingSkills": "PROGRAMOVACIE SCHOPNOSTI",
    "drivingLicence": "VODIČSKÝ PREUKAZ",
    "type": "Typ",
    "interests": "ZÁUJMY",
    "interest1": "Počítač",
    "interest2": "Šport",
    "interest3": "Cestovanie",
    "interest4": "Spoločnosť",
    "myWorkingProjects": "Projekty na ktorých som pracoval",
    "getMore": "Viac",
    "thesis": "Moja bakalárska práca",
    "project1": "Platforma na interaktívne pohovory",
    "project2": "Systém na manažovanie konferencie",
    "project3": "Systém na vyhodnocovanie pretekov",
    "project4": "Aplikácia pre zamestnancov banky",
    "project1Title": "Skreenbe - Platforma na online interaktívne pohovory",
    "project2Title": "Systém na manažovanie konferencie pre Fakultu matematiky, fyziky a informatiky",
    "project3Title": "Systém na vyhodnocovanie pretekov pre Západoslovenskú ligu v orientačnom behu",
    "project4Title": "Aplikácia pre zamestnancov banky",
    "project1Desc": "Posledný rok som pracoval pod vedením programátora seniora vo firme GQSystems. Programovali sme platformu na interaktívne online pohovory – Skreenbe. Išlo o komplexnú multijazyčnú aplikáciu s veľkým množstvom funkcionality. Mojou úlohou bolo najmä programovanie front-endu v Reacte. Upravoval som existujúcu aplikáciu podľa požiadaviek majiteľa, ktoré, ako to už býva, sa často menili. Ďalej som fixoval najrôznejšie typy bugov, ale aj vytváral novú funkcionalitu.",
    "project2Desc": "V rámci mojej bakalárskej práce som vytvoril systém na manažovanie konferencií v reálnom čase. Tento systém bude používaný na konferenciách, ktoré sa na fakulte konajú, ako je napríklad Študentská vedecká konferencia. Taktiež sa systém využije aj na konferenciách mimo fakulty. Požiadavky na tento systém boli striktne dané a na splnenie niektorých z nich vyžadovalo vyriešiť náročné algoritmické problémy. Viac o systéme si môžete prečítať v mojej bakalárskej práci.",
    "project3Desc": "Tento projekt bol pre skutočného zadávateľa - Západoslovenskú ligu v orientačnom behu. Doteraz sa body počítali ručne. Aplikácia však dokáže body spočítať automaticky. Výstupom je HTML stránka s celkovými bodmi pretekárov podľa vybraného spôsobu bodovania. Na tomto projekte som pracoval v týme štyroch ľudí. Na našu koordináciu sme používali Git a Github. Mojou hlavnou úlohou bolo vytvoriť algoritmus na priraďovanie bodov pretekárom.",
    "project4Desc": "Toto je môj školský projekt na predmet Databázy 2. Hlavný dôraz je kladený na prácu s databázou, takže aplikácia má len jednoduché používateľské rozhranie. Inak je však aplikácia veľmi komplexná. Existujú tri typy účtov, každý z nich má svoje vlastnosti. Medzi účtami je možné vykonávať transfery, ktoré môžu byť v rôznych menách. Transfery do iných bánk sa vykonajú až nasledujúci deň preto je nutné riešiť aj dennú a mesačnú uzávierku. Sporiacim a terminovaným účtom musia byť nakonci mesiaca pripísané úroky.",
    "about1": "Už počas štúdia na gymnáziu ma bavili dva odbory - informatika aj ekonomika. Keďže som si nevedel medzi nimi vybrať, rozhodol som sa vyštudovať oba. Podľa môjho názoru vám výška dá len všeobecný základ, konkrétne veci sa aj tak musíte naučiť sami. A pre tento základ sú 3 roky dostatočná doba.",
    "about2": "Výhodou vysokej školy, zvlášť v oblasti informatiky je však to, že sa stretnete s najrôznejšími technológiami a nástrojmi. Práve tu zistíte, ktoré vás bavia viac, ktoré menej. Mňa počas štúdia Aplikovanej informatiky na Fakulte matematiky, fyziky a informatiky Univerzity Komenského zaujaly najmä webové aplikácie, zvlášť ich frontendová časť. Je to oblasť v ktorej by som rád pokračoval ďalej. Počas leta 2019 som pracoval v Tatrabanke ako vývojár. Vyvíjali sme nový systém Gate+, ktorý má postupne nahradiť zastaralý Gate. Bola to zaujímava skúsenosť, pracoval som hlavne na fixovaní defektov.",
    "about3a": "Následne som si vybral ako tému bakalárskej práce tvorbu aplikácie v JavaScripte. Išlo o naprogramovanie aplikácie na manažovanie konferencií v reálnom čase. Vyskúšal som si celý životný cyklus tvorby aplikácie - zozbieranie požiadaviek, ich analýzu, vytvorenie návrhu systému, jeho implementáciu, až po testovanie. Viac o mojej práci je v",
    "about3b": "sekcií Projekty",
    "about3c": "Frontend aplikácie bolo požadované naprogramovať vo Vanilla JavaScripte. Medzičasom som sa začal učiť aj knižnicu React, a teraz si aspoň viem lepšie predstaviť jej prínos oproti programovaniu vo Vanilla JavaScripte.",
    "about4": "Moja posledná skúsenosť je z vývoja interaktívnej platformy na pohovory - Skreenbe. Skreenbe je rozsiahla aplikácia s veľkým množstvom funkcionality. Pod vedením seniornejšieho programátora som získal cenné skúsenosti, obzvlášť s Reactom, ale tiež s Reduxom, Node.js a MongoDb. Pracoval som na fixovaní bugov, vylepšovaní existujúcej funkcionality, ale aj vytváraní novej funkcionality.",
    "about5": "Čo sa týka mojej osobnosti, myslím si, že som cieľavedomý a vytrvalý. Rád sa učím nové technológie a rozvíjam svoje schopnosti. Zároveň som však veľmi spoločenský človek. Veľa ľudí neverí, keď sa dozvie, že som programátor :). Rád zájdem s partiou na pivo, ale zároveň sa snažím pravidelne športovať. Hlavne počas leta rád cestujem.",
    "about6": "Momentálne by som si rád našiel prácu ako react vývojár alebo niečo k tomu blízke. Nejakú pozíciu, kde by som sa mohol priučiť ďalšie nové veci. Neplánujem viac študovať na univerzite, takže preferujem prácu na plný uväzok.",
    "seeApplication": "Vidieť aplikáciu",
    "readTheThesis": "Čítať prácu",
    "readSupervisor": "Posudok školiteľa",
    "readOpponent": "Posudok oponenta",
    "sourceCode": "Zdrojový kód",
    "readDocumentation": "Dokumentácia",
    "githubRepo": "Github repozitár",
    "assignment": "Zadanie",
    "aboutProject": "Info"
}